/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package testt;


import java.util.Random;

public class Testt {
    
   public final  static String[]  nameList1={"怡","文","婷","雅","佳","君","志","嘉","俊","家","宏","偉","明","慧","欣","宜","惠","彥","如","瑋","宇","豪","芳","建","雯","佩","育","柏","凱","智","哲","宗","維","銘","傑","淑","玲","冠","穎","玉","翔","瑜","華","廷","孟","政","儀","安","仁","郁","涵","子","靜","翰","美","國","庭","思","軒","珊","賢","珮","瑩","霖","儒","蓉","正","瑞","鈞","秀","鴻","倫","伶","盈","琪","萱","威","元","佑","信","德","立","聖","詩","世","婉","潔","昱","鈺","樺","敏","姿","榮","承","慈","曉","奕","芬","書","逸","萍","馨","士","真","毅","祥","茹","中","筱","琳","菁","弘","良","博","娟","慶","芸","勳","依","達","心","永","恩","韋","成","峰","毓","杰","緯","宛","昌","振","璇","麗","于","妤","忠","青","誠","裕","龍","均","民","淳","貞","旻","容","純","平","皓","品","耀","昇","寧","勝","憲","浩","靖","啟","吟","英","莉","辰","韻","薇","健","綺","蕙","瑄","仲","秋","秉","群","祐","修","亭","珍","揚","昭","琦","任","益","源","光","詠","玟","景","富","駿","柔","泰","閔","羽","輝","堯","雲","琬","峻","蓁","伊","禎","燕","千","易","東","巧","鳳","昀","致","培","晴","漢","伯","睿","芝","敬","義","亞","方","興","翊","清","鈴","筠","玫","一","瓊","隆","丞","倩","麟","晏","岳","湘","崇","帆","臻","強","欽","展","沛","雄","尚","雨","晉","名","竹","甫","旭","喬","澤","諭","宣","俐","斌","凡","紹","泓","學","筑","甄","舒","坤","謙","梅","若","璋","舜","全","琇","遠","奇","俞","芷","映","盛","金","虹","懿","蘭","婕","新","碩","乃","彬","仕","媛","融","孝","豐","錦","意","嵐","諺","至","彰","淵","天","吉","尹","昕","大","云","祺","汝","順","瑾","瀚","松","榕","姵","力","又","幸","和","齡","昆","男","人","憶","之","勇","捷","陽","晨","原","以","齊","超","為","誼","采","雪","朝","鑫","恆","鵬","菱","兆","長","卉","惟","邦","卿","生","楷","竣","香","亮","亦","誌","妍","春","程","銓","煒","綸","暐","愷","素","其","小","瑛","紋","姍","妮","碧","季","福","汶","治","鋒","妙","暉","綾","桂","鼎","勛","晟","叡","禹","星","可","聰","寬","煜","洋","億","翎","騰","淇","月","鎮","呈","宥","貴","桓","棋","利","茵","茜","凌","懷","羿","寶","妏","岑","岱","麒","瑤","進","璟","屏","嫻","琮","蘋","友","章","侑","念","康","蔚","曜","蓮","亨","林","延","森","恬","權","上","宸","蓓","琴","函","剛","煌","耿","茂","彤","玄","允","瀅","升","勤","劭","少","珈","音","介","馥","克","南","繼","霆","年","傳","錡","昶","苓","曼","葳","渝","蒨","翠","顯","禮","瑀","百","典","善","紀","榆","肇","羚","迪","炳","霈","煥","州","有","得","賓","皇","道","洲","綱","祖","棠","雁","先","紫","霞","重","斐","璿","喻","佐","航","錚","珠","芃","杏","川","梓","恒","武","苑","藝","孜","評","定","然","曄","耕","陵","勻","言","菀","嫺","震","聿","鳴","艾","登","希","儷","韶","予","炫","頤","薏","基","紘","守","葦","堂","歆","能","妃","谷","訓","崴","彩","資","陞","珺","山","衡","軍"};
   public final  static String[]  nameList2={"怡","文","婷","雅","佳","君","志","嘉","俊","家","宏","偉","明","慧","欣","宜","惠","彥","如","瑋","宇","豪","芳","建","雯","佩","育","柏","凱","智","哲","宗","維","銘","傑","淑","玲","冠","穎","玉","翔","瑜","華","廷","孟","政","儀","安","仁","郁","涵","子","靜","翰","美","國","庭","思","軒","珊","賢","珮","瑩","霖","儒","蓉","正","瑞","鈞","秀","鴻","倫","伶","盈","琪","萱","威","元","佑","信","德","立","聖","詩","世","婉","潔","昱","鈺","樺","敏","姿","榮","承","慈","曉","奕","芬","書","逸","萍","馨","士","真","毅","祥","茹","中","筱","琳","菁","弘","良","博","娟","慶","芸","勳","依","達","心","永","恩","韋","成","峰","毓","杰","緯","宛","昌","振","璇","麗","于","妤","忠","青","誠","裕","龍","均","民","淳","貞","旻","容","純","平","皓","品","耀","昇","寧","勝","憲","浩","靖","啟","吟","英","莉","辰","韻","薇","健","綺","蕙","瑄","仲","秋","秉","群","祐","修","亭","珍","揚","昭","琦","任","益","源","光","詠","玟","景","富","駿","柔","泰","閔","羽","輝","堯","雲","琬","峻","蓁","伊","禎","燕","千","易","東","巧","鳳","昀","致","培","晴","漢","伯","睿","芝","敬","義","亞","方","興","翊","清","鈴","筠","玫","一","瓊","隆","丞","倩","麟","晏","岳","湘","崇","帆","臻","強","欽","展","沛","雄","尚","雨","晉","名","竹","甫","旭","喬","澤","諭","宣","俐","斌","凡","紹","泓","學","筑","甄","舒","坤","謙","梅","若","璋","舜","全","琇","遠","奇","俞","芷","映","盛","金","虹","懿","蘭","婕","新","碩","乃","彬","仕","媛","融","孝","豐","錦","意","嵐","諺","至","彰","淵","天","吉","尹","昕","大","云","祺","汝","順","瑾","瀚","松","榕","姵","力","又","幸","和","齡","昆","男","人","憶","之","勇","捷","陽","晨","原","以","齊","超","為","誼","采","雪","朝","鑫","恆","鵬","菱","兆","長","卉","惟","邦","卿","生","楷","竣","香","亮","亦","誌","妍","春","程","銓","煒","綸","暐","愷","素","其","小","瑛","紋","姍","妮","碧","季","福","汶","治","鋒","妙","暉","綾","桂","鼎","勛","晟","叡","禹","星","可","聰","寬","煜","洋","億","翎","騰","淇","月","鎮","呈","宥","貴","桓","棋","利","茵","茜","凌","懷","羿","寶","妏","岑","岱","麒","瑤","進","璟","屏","嫻","琮","蘋","友","章","侑","念","康","蔚","曜","蓮","亨","林","延","森","恬","權","上","宸","蓓","琴","函","剛","煌","耿","茂","彤","玄","允","瀅","升","勤","劭","少","珈","音","介","馥","克","南","繼","霆","年","傳","錡","昶","苓","曼","葳","渝","蒨","翠","顯","禮","瑀","百","典","善","紀","榆","肇","羚","迪","炳","霈","煥","州","有","得","賓","皇","道","洲","綱","祖","棠","雁","先","紫","霞","重","斐","璿","喻","佐","航","錚","珠","芃","杏","川","梓","恒","武","苑","藝","孜","評","定","然","曄","耕","陵","勻","言","菀","嫺","震","聿","鳴","艾","登","希","儷","韶","予","炫","頤","薏","基","紘","守","葦","堂","歆","能","妃","谷","訓","崴","彩","資","陞","珺","山","衡","軍"};

    public static void main(String[] args) {
        
        System.out.println(InsertNameToken("王大名"));

    }
    public static String InsertNameToken(String realName) {

        String name = realName;
        String result = null;
        String[] nameAll = new String[550];
     
            Random random = new Random();
            int i = random.nextInt(550);
            int j = random.nextInt(550);
            for (; i == j;) {
                j = random.nextInt(550);
            }
           /* Cell n1 = sheet.getCell(0, i);//(行/列)           
            String content1 = n1.getContents(); // 獲得單元格的內容  
            */
            
            if (name.length() == 3) {
                result = name.substring(0, 1) + nameList1[i] + nameList2[j];
            } else if (name.length() == 2) {
                result = name.substring(0, 1) + nameList1[i];
            } else if (name.length() == 4) {
                result = name.substring(0, 2) + nameList1[i] + nameList2[j];
            }            
            //book.close();

        return result;
    }
}

